# Read Write Data From Database (read_sql, to_sql)
# Read Database records into pandas dataframe and write it back
We will cover
1) pd.read_sql_table
2) pd.read_sql_query
3) df.to_sql
4) pd.read_sql (which is just wrapper for first 2 methods)

In [5]:
import pandas as pd
import sqlalchemy

In [15]:
import sqlalchemy
engine = sqlalchemy.create_engine('oracle://hassam:123@localhost:1521/xe')
# mysql+pymysql://root:@localhost:3306/application

In [79]:
# df = pd.read_sql_table('CUSTOMER',engine,schema='HASSAM')
# df
query = "SELECT * FROM customer"
df = pd.read_sql_query(query, engine)
df

            name  phone_number  customer_id
0           SHAQ   123-456-789            1
1    Bob Johnson  987-654-3210            2
2  Charlie Brown  555-555-5555            3

In [68]:
# we can indexed the name also
df = pd.read_sql_query(query, engine,index_col=['name'])
df

               phone_number  customer_id
name
SHAQ            123-456-789            1
Bob Johnson    987-654-3210            2
Charlie Brown  555-555-5555            3

In [69]:
query='''
SELECT c.NAME AS Customer_Name, c.PHONE_NUMBER, o.NAME AS Order_Name, o.AMOUNT
    FROM customer c
    JOIN orders o ON c.CUSTOMER_ID = o.CUSTOMER_ID
'''
df = pd.read_sql_query(query,engine)
df

   customer_name  phone_number order_name  amount
0           SHAQ   123-456-789    Order A  100.00
1    Bob Johnson  987-654-3210    Order B  150.50
2  Charlie Brown  555-555-5555    Order C  200.75

It is a very simple query but if we have alot of records to read then we use junk size argument to read the records

# Now we will do the reverse operation, writing data from df into sql table

In [75]:
df = pd.read_csv('14_sqldata.csv')
df

  customer_name phone_number order_name      amount
0         Ahmad  129-432-333    Order D  210.000000
1          Khan  127-321-432    Order E  230.900000
2       Shareef  129-432-334    Order F  123.000000
3           Ali  127-321-433    Order G  100.966667
4        Kamran  129-432-335    Order H   57.466667
5        Jabbar  127-321-434    Order I   13.966667

as we can see the name in our csv file of customers and phone numbers are not the same as we have in our sql table so for that we can use rename fucntion

In [74]:
df.rename(columns={
    'CUSTOMER_NAME': 'customer_name',
    'PHONE_NUMBER': 'phone_number',
    'ORDER_NAME' : 'order_name',
    'AMOUNT':'amount'
}, inplace = True)
df # if we dont want to use inplace function then we can simply use df =  df.rename(columns= at the start

   customer_name  phone_number order_name  amount
0           SHAQ   123-456-789    Order A  100.00
1    Bob Johnson  987-654-3210    Order B  150.50
2  Charlie Brown  555-555-5555    Order C  200.75